#include <stdio.h>
#include <stdlib.h>
#include <time.h>

void array_sorting();
void column_exchache();

int main()
{
    array_sorting();//Задание 1
    //column_exchache();//Задание 2
    
    return 0;
}

void array_sorting()
{
    int arr[100][100];
    int n,m;

    printf("Введите количество строк в массиве: ");
    scanf("%i",&n);
    printf("Введите количество столбцов в массиве: ");
    scanf("%i",&m);

    if(n<1||m<1)
    {
        printf("Количество строк или столбцов должно быть больше нуля!\n");
    }
    else
    {
    //-------Заполнение массива случайными числами-------------------------
        srand(time(NULL));
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < m; j++)
            {
                arr[i][j] = rand()%21+(-10);
            }
        }
        printf("\n");
    //---------------------------------------------------------------------

    //-------Печать массива в консоль--------------------------------------
        printf("Изначальный массив\n");
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < m; j++)
            {
                printf("%4i ",arr[i][j]);
            }
            printf("\n");
        }
        printf("\n");
    //---------------------------------------------------------------------

    //-------Сортировка массива построчно----------------------------------
        int count = 0;
        for (int i = 0; i < n; i++)
        {
            bool isSorted = true;
            while(isSorted)
            {
                isSorted = false;
                for (int j = 0; j < m-1; j++)
                {
                    if(arr[i][j]>arr[i][j+1])
                    {
                        int buff = arr[i][j+1];
                        arr[i][j+1]=arr[i][j];
                        arr[i][j]=buff;
                        isSorted = true;
                    }
                }
                count++;
            }
        }
    //---------------------------------------------------------------------

    //-------Печать массива в консоль--------------------------------------
        printf("Отсортированный массив\n");
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < m; j++)
            {
                printf("%4i ",arr[i][j]);
            }
            printf("\n");
        }
        printf("\nКоличество итераций %i",count);
    //---------------------------------------------------------------------
    }
}

void column_exchache()
{
    int arr[100][100];
    int n,m;

    printf("Введите количество строк в массиве: ");
    scanf("%i",&n);
    printf("Введите количество столбцов в массиве: ");
    scanf("%i",&m);

    if(n<1||m<1)
    {
        printf("Количество строк или столбцов должно быть больше нуля!\n");
    }
    else
    {
    //---------------Заполнение массива случайными числами---------------------
        srand(time(NULL));
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < m; j++)
            {
                arr[i][j] = rand()%11;
            }
        }
        printf("\n");
    //-------------------------------------------------------------------------

    //---------------Печать массива в консоль----------------------------------
        printf("Изначальный массив\n");
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < m; j++)
            {
                printf("%4i ",arr[i][j]);
            }
            printf("\n");
        }
        printf("\n");
    //-------------------------------------------------------------------------

    //---------------Обмен первого и последнего столбца значениями-------------
        for (int i = 0; i < n; i++)
        {
            int buf = arr[i][0];
            arr[i][0]=arr[i][m-1];
            arr[i][m-1]=buf;
        }
    //-------------------------------------------------------------------------

    //---------------Печать массива в консоль----------------------------------
        printf("Конечный массив\n");
        for (int i = 0; i < n; i++)
        {
            for (int j = 0; j < m; j++)
            {
                printf("%4i ",arr[i][j]);
            }
            printf("\n");
        }
        printf("\n");
    //-------------------------------------------------------------------------
    }
}